AchimPieters/esp32-homekit-Sunshade/main/main.c
// ── Timing helper ─────────────────────────────────────────────────────────────
static inline uint32_t now_ms(void) {
    return (uint32_t)(esp_timer_get_time() / 1000ULL);
}

// ── NVS helpers ───────────────────────────────────────────────────────────────
static void nvs_load_calibration(void) {
    nvs_handle_t h;

    if (nvs_open(NVS_NS, NVS_READONLY, &h) != ESP_OK) {
        ESP_LOGI(TAG_NVS, "No calibration found; using default %lu ms",
                 (unsigned long)DEFAULT_TRAVEL_MS);
        return;
    }

    uint8_t done = 0;
    if (nvs_get_u8(h, NVS_CAL_DONE, &done) != ESP_OK) {
        done = 0;
    }

    if (done) {
        uint32_t ms = DEFAULT_TRAVEL_MS;
        if (nvs_get_u32(h, NVS_CAL_MS, &ms) == ESP_OK && ms > 0) {
            s_cal_ms   = ms;
            s_cal_done = true;
            ESP_LOGI(TAG_NVS, "Calibration loaded: %lu ms", (unsigned long)ms);
        } else {
            ESP_LOGW(TAG_NVS, "Calibration flag set but value invalid; using default");
        }
    } else {
        ESP_LOGI(TAG_NVS, "Device not calibrated; using default %lu ms",
                 (unsigned long)DEFAULT_TRAVEL_MS);
    }

    nvs_close(h);
}

static void nvs_save_calibration(uint32_t travel_ms) {
    nvs_handle_t h;

    if (nvs_open(NVS_NS, NVS_READWRITE, &h) != ESP_OK) {
        ESP_LOGE(TAG_NVS, "Cannot open NVS for calibration save");
        return;
    }

    esp_err_t err = nvs_set_u8(h, NVS_CAL_DONE, 1);
    if (err == ESP_OK) err = nvs_set_u32(h, NVS_CAL_MS, travel_ms);
    if (err == ESP_OK) err = nvs_commit(h);
    nvs_close(h);

    if (err != ESP_OK) {
        ESP_LOGE(TAG_NVS, "Calibration save failed: %s", esp_err_to_name(err));
    } else {
        ESP_LOGI(TAG_NVS, "Calibration saved: %lu ms", (unsigned long)travel_ms);
    }
}

static uint8_t nvs_load_last_position(void) {
    nvs_handle_t h;
    uint8_t pos = 0;

    if (nvs_open(NVS_NS, NVS_READONLY, &h) != ESP_OK) {
        return 0;
    }

    if (nvs_get_u8(h, NVS_LAST_POS, &pos) != ESP_OK || pos > 100) {
        pos = 0;
    }
    nvs_close(h);

    ESP_LOGI(TAG_NVS, "Last saved position: %d%%", pos);
    return pos;
}

static void nvs_save_last_position(uint8_t pos) {
    if (pos > 100) {
        pos = 100;
    }

    nvs_handle_t h;

    if (nvs_open(NVS_NS, NVS_READWRITE, &h) != ESP_OK) {
        return;
    }

    esp_err_t err = nvs_set_u8(h, NVS_LAST_POS, pos);
    if (err == ESP_OK) err = nvs_commit(h);
    nvs_close(h);

    if (err != ESP_OK) {
        ESP_LOGW(TAG_NVS, "Failed to save last position: %s", esp_err_to_name(err));
    } else {
        ESP_LOGD(TAG_NVS, "Saved target position: %d%%", pos);
    }
}

// ── LED ───────────────────────────────────────────────────────────────────────
static void led_write(bool on) {
    gpio_set_level(LED_GPIO, on ? 1 : 0);
}

// ── Relay control ─────────────────────────────────────────────────────────────
static void relays_all_off(void) {
    gpio_set_level(RELAY_OPEN_GPIO,  0);
    gpio_set_level(RELAY_CLOSE_GPIO, 0);
    ESP_LOGD(TAG_RELAY, "Both relays OFF");
}

static void relay_activate_open(void) {
    gpio_set_level(RELAY_CLOSE_GPIO, 0);
    gpio_set_level(RELAY_OPEN_GPIO,  1);
    ESP_LOGD(TAG_RELAY, "OPEN relay ON");
}

static void relay_activate_close(void) {
    gpio_set_level(RELAY_OPEN_GPIO,  0);
    gpio_set_level(RELAY_CLOSE_GPIO, 1);
    ESP_LOGD(TAG_RELAY, "CLOSE relay ON");
}

// ── HomeKit characteristics ───────────────────────────────────────────────────
static void target_position_setter(homekit_value_t value);

static homekit_characteristic_t current_pos_ch =
    HOMEKIT_CHARACTERISTIC_(CURRENT_POSITION, 0);

static homekit_characteristic_t target_pos_ch =
    HOMEKIT_CHARACTERISTIC_(TARGET_POSITION, 0,
        .setter = target_position_setter);

static homekit_characteristic_t pos_state_ch =
    HOMEKIT_CHARACTERISTIC_(POSITION_STATE, 2);

static homekit_characteristic_t hold_pos_ch =
    HOMEKIT_CHARACTERISTIC_(HOLD_POSITION, false,
        .setter = hold_position_setter);

static void homekit_notify_position(void) {
    current_pos_ch.value = HOMEKIT_UINT8((uint8_t)s_cur_pos);
    target_pos_ch.value  = HOMEKIT_UINT8((uint8_t)s_tgt_pos);
    pos_state_ch.value   = HOMEKIT_UINT8((uint8_t)s_motion);

    homekit_characteristic_notify(&current_pos_ch, current_pos_ch.value);
    homekit_characteristic_notify(&target_pos_ch, target_pos_ch.value);
    homekit_characteristic_notify(&pos_state_ch, pos_state_ch.value);

    ESP_LOGD(TAG, "HomeKit notify: current=%d target=%d state=%d",
             s_cur_pos, s_tgt_pos, s_motion);
}

// ── Movement task ─────────────────────────────────────────────────────────────
static void movement_task(void *arg) {
    const uint32_t travel_ms = (s_cal_ms > 0) ? s_cal_ms : DEFAULT_TRAVEL_MS;
    const float    delta     = 100.0f * POS_UPDATE_INTERVAL_MS / (float)travel_ms;

    motion_dir_t last_dir         = s_motion;
    float        pos_f            = (float)s_cur_pos;
    int          last_notified    = s_cur_pos;

    for (;;) {
        vTaskDelay(pdMS_TO_TICKS(POS_UPDATE_INTERVAL_MS));

        motion_dir_t dir = s_motion;

        if (dir != last_dir) {
            pos_f    = (float)s_cur_pos;
            last_dir = dir;
        }

        if (dir == MOTION_STOPPED) {
            relays_all_off();
            homekit_notify_position();
            break;
        }

        int tgt = s_tgt_pos;

        if (dir == MOTION_OPENING) {
            pos_f += delta;
            if (pos_f >= (float)tgt) {
                s_cur_pos = tgt;
                s_motion  = MOTION_STOPPED;
                relays_all_off();
                homekit_notify_position();
                ESP_LOGI(TAG, "Reached %d%% (open)", tgt);
                break;
            }
        } else {
            pos_f -= delta;
            if (pos_f <= (float)tgt) {
                s_cur_pos = tgt;
                s_motion  = MOTION_STOPPED;
                relays_all_off();
                homekit_notify_position();
                ESP_LOGI(TAG, "Reached %d%% (close)", tgt);
                break;
            }
        }

