AchimPieters/esp32-homekit-Sunshade/main/main.c
// ── Rain sensor ───────────────────────────────────────────────────────────────
#ifdef CONFIG_RAIN_SENSOR_ENABLE
/*
 * MH-RD rain sensor — implementation notes:
 *
 * POWER:   VCC = 3.3 V, GND = GND. The module has an onboard LM393 comparator.
 *          Sensitivity is set via the onboard potentiometer.
 *
 * OUTPUT:  DO = digital output. Active-low by default (DO goes LOW when rain
 *          is detected). Configure RAIN_SENSOR_ACTIVE_LEVEL = 0 (default).
 *          AO (analog output) is not used.
 *
 * NOISE:   The sensing pad corrodes outdoors over time. Mount the pad under a
 *          sheltered overhang to limit exposure. The 2 s debounce prevents
 *          false triggers from brief condensation or dust.
 */
static void rain_task(void *arg) {
    gpio_config_t io_conf = {
        .pin_bit_mask = (1ULL << RAIN_GPIO),
        .mode         = GPIO_MODE_INPUT,
        .pull_up_en   = (RAIN_ACTIVE_LEVEL == 0) ? GPIO_PULLUP_ENABLE  : GPIO_PULLUP_DISABLE,
        .pull_down_en = (RAIN_ACTIVE_LEVEL == 1) ? GPIO_PULLDOWN_ENABLE : GPIO_PULLDOWN_DISABLE,
        .intr_type    = GPIO_INTR_DISABLE,
    };
    ESP_ERROR_CHECK(gpio_config(&io_conf));

    ESP_LOGI(TAG_RAIN,
             "MH-RD ready: GPIO%d active_%s poll=%lums debounce=%lums",
             RAIN_GPIO,
             RAIN_ACTIVE_LEVEL ? "high" : "low",
             (unsigned long)RAIN_POLL_MS,
             (unsigned long)RAIN_DEBOUNCE_MS);

    bool     last_raw   = (gpio_get_level(RAIN_GPIO) == RAIN_ACTIVE_LEVEL);
    uint32_t changed_at = now_ms();
    bool     stable     = last_raw;

    for (;;) {
        vTaskDelay(pdMS_TO_TICKS(RAIN_POLL_MS));

        bool     raw  = (gpio_get_level(RAIN_GPIO) == RAIN_ACTIVE_LEVEL);
        uint32_t now  = now_ms();

        if (raw != last_raw) {
            last_raw   = raw;
            changed_at = now;
        }

        if ((now - changed_at) >= RAIN_DEBOUNCE_MS) {
            bool new_stable = raw;

            if (new_stable && !stable) {
                ESP_LOGW(TAG_RAIN, "Rain detected: closing for protection (saved pos=%d%%)",
                         s_tgt_pos);
                s_rain_saved_pos = s_tgt_pos;
                s_rain_closed    = true;
                sunshade_close();
            } else if (!new_stable && stable) {
                ESP_LOGI(TAG_RAIN, "Rain stopped: restoring to %d%%", s_rain_saved_pos);
                s_rain_closed = false;
                sunshade_move_to(s_rain_saved_pos);
            }

            stable = new_stable;
        }
    }
}
#endif

// ── Entry point ───────────────────────────────────────────────────────────────
void app_main(void) {
    ESP_ERROR_CHECK(lifecycle_nvs_init());
    lifecycle_log_post_reset_state("INFORMATION");
    ESP_ERROR_CHECK(lifecycle_configure_homekit(&revision, &ota_trigger, "INFORMATION"));

    gpio_init_all();

    nvs_load_calibration();

    ttp_init();

    if (xTaskCreate(ttp_task, "ttp_task", 4096, NULL, 5, NULL) != pdPASS) {
        ESP_LOGE(TAG, "Failed to create TTP task");
    }

    // Physical lifecycle button.
    // Wiring: GND -> button -> GPIO25.
    // Active-low requires a pull-up. Configure it explicitly so the input
    // cannot float if the button library does not enable the pull-up itself.
    gpio_config_t btn_io = {
        .pin_bit_mask = (1ULL << BUTTON_GPIO),
        .mode         = GPIO_MODE_INPUT,
        .pull_up_en   = GPIO_PULLUP_ENABLE,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type    = GPIO_INTR_DISABLE,
    };
    ESP_ERROR_CHECK(gpio_config(&btn_io));

    ESP_LOGI(TAG_BUTTON, "Physical button GPIO%d level at boot: %d",
             BUTTON_GPIO, gpio_get_level(BUTTON_GPIO));

    button_config_t btn_cfg    = button_config_default(button_active_low);
    btn_cfg.max_repeat_presses = 3;
    btn_cfg.long_press_time    = 3000;

    if (button_create(BUTTON_GPIO, btn_cfg, button_callback, NULL)) {
        ESP_LOGE(TAG_BUTTON, "Failed to init button on GPIO%d", BUTTON_GPIO);
    }

    if (s_cal_done) {
        uint8_t last_pos = nvs_load_last_position();
        ESP_LOGI(TAG, "Calibrated: starting homing sequence (last pos: %d%%)", last_pos);
        if (xTaskCreate(homing_task, "homing", 4096,
                        (void *)(uintptr_t)last_pos, 4, NULL) != pdPASS) {
            ESP_LOGE(TAG, "Failed to create homing task");
        }
    } else {
        ESP_LOGW(TAG, "Not calibrated: skipping homing.");
        ESP_LOGW(TAG, "Hold STOP touch pad for 3 s to start calibration.");
    }

#ifdef CONFIG_WIND_SENSOR_ENABLE
    if (xTaskCreate(wind_task, "wind_task", 3072, NULL, 3, NULL) != pdPASS) {
        ESP_LOGE(TAG, "Failed to create wind task");
    }
#endif

#ifdef CONFIG_RAIN_SENSOR_ENABLE
    if (xTaskCreate(rain_task, "rain_task", 2048, NULL, 3, NULL) != pdPASS) {
        ESP_LOGE(TAG, "Failed to create rain task");
    }
#endif

    esp_err_t wifi_err = wifi_start(on_wifi_ready);

    if (wifi_err == ESP_ERR_NVS_NOT_FOUND) {
        ESP_LOGW("WIFI", "WiFi not configured; provisioning required");
    } else if (wifi_err != ESP_OK) {
        ESP_LOGE("WIFI", "WiFi start failed: %s", esp_err_to_name(wifi_err));
    }
}
